<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"064a76813f6a76ce53c996a0fac0b37cd5a1c2552dba6d24df69cbb96d83422f","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #674 at https://github.com/cal-itp/data-infra/actions/runs/17868085893","plan_out_hash":"d1290025762052bf4bc8ab5b575cd47d9cde6b656c1b594cc09c8a9930cbf866","plan_hash":"bc55d2ef49321a3a54629bfcc85ef925e4afad79fbc0cf1ae6da4508a82bbf70","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 6 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "xb5ijA==" -> (known after apply)
!~      detect_md5hash      = "TikXKR3qOHqFPuMcdmTvOQ==" -> "different hash"
!~      generation          = 1758303741652895 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "TikXKR3qOHqFPuMcdmTvOQ==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/intermediate/gtfs/int_gtfs_rt__trip_updates_trip_stop_day_map_grouping.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "D9+hYw==" -> (known after apply)
!~      detect_md5hash      = "3hlxE3peUq2lo9OYCnhQPw==" -> "different hash"
!~      generation          = 1758303741165658 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/intermediate/gtfs/int_gtfs_rt__trip_updates_trip_stop_day_map_grouping.sql"
!~      md5hash             = "3hlxE3peUq2lo9OYCnhQPw==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/gtfs/int_gtfs_rt__trip_updates_trip_stop_day_map_grouping.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/fct_stop_time_metrics.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "//6ccA==" -> (known after apply)
!~      detect_md5hash      = "ZVuiSlVvdvbbW0qdNtNM9A==" -> "different hash"
!~      generation          = 1758303740677792 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs/fct_stop_time_metrics.sql"
!~      md5hash             = "ZVuiSlVvdvbbW0qdNtNM9A==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_stop_time_metrics.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/fct_trip_updates_stop_metrics.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "x4XCvw==" -> (known after apply)
!~      detect_md5hash      = "2tioG7GmWZWim8J1KuZ6LA==" -> "different hash"
!~      generation          = 1758303740685127 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs/fct_trip_updates_stop_metrics.sql"
!~      md5hash             = "2tioG7GmWZWim8J1KuZ6LA==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_trip_updates_stop_metrics.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/fct_trip_updates_trip_metrics.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "rTBXww==" -> (known after apply)
!~      detect_md5hash      = "rkUtVWRQTilKL2p9qrVMgw==" -> "different hash"
!~      generation          = 1758303741227245 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs/fct_trip_updates_trip_metrics.sql"
!~      md5hash             = "rkUtVWRQTilKL2p9qrVMgw==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_trip_updates_trip_metrics.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "Qi2A7A==" -> (known after apply)
!~      detect_md5hash      = "3fFm3toh/4DvVQq5WkBhBw==" -> "different hash"
!~      generation          = 1758303743204942 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "3fFm3toh/4DvVQq5WkBhBw==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 6 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #674](https://github.com/cal-itp/data-infra/actions/runs/17868085893)